/************************************************************************************************************************
基于QOI格式的图像编解码算法
@brief  接口头文件
@date   2023/03/07
@author 陈家耀
************************************************************************************************************************/

#include "main.h"

////////////////////////////////////////////////////////////////////////////////////////////////////////////

int enhanced_qoi_encode(unsigned char* prgb, unsigned char* pCompressed, int img_w, int img_h); // 对图像进行QOI编码
void enhanced_qoi_decode(unsigned char* pencoded, unsigned char* pdecoded, int img_w, int img_h); // 对图像进行QOI解码
